In [19]:
import sqlite3
import requests
import pandas as pd

In [21]:
csv_url = "https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv"
df_csv = pd.read_csv(csv_url)
df_csv

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [23]:
json_url = "https://jsonplaceholder.typicode.com/users"
df_json = pd.read_json(json_url)
df_json

,id,name,username,email,address,phone,website,company
0,1,Leanne Graham,Bret,Sincere@april.biz,"{'street': 'Kulas Light', 'suite': 'Apt. 556',...",1-770-736-8031 x56442,hildegard.org,"{'name': 'Romaguera-Crona', 'catchPhrase': 'Mu..."
1,2,Ervin Howell,Antonette,Shanna@melissa.tv,"{'street': 'Victor Plains', 'suite': 'Suite 87...",010-692-6593 x09125,anastasia.net,"{'name': 'Deckow-Crist', 'catchPhrase': 'Proac..."
2,3,Clementine Bauch,Samantha,Nathan@yesenia.net,"{'street': 'Douglas Extension', 'suite': 'Suit...",1-463-123-4447,ramiro.info,"{'name': 'Romaguera-Jacobson', 'catchPhrase': ..."
3,4,Patricia Lebsack,Karianne,Julianne.OConner@kory.org,"{'street': 'Hoeger Mall', 'suite': 'Apt. 692',...",493-170-9623 x156,kale.biz,"{'name': 'Robel-Corkery', 'catchPhrase': 'Mult..."
4,5,Chelsey Dietrich,Kamren,Lucio_Hettinger@annie.ca,"{'street': 'Skiles Walks', 'suite': 'Suite 351...",(254)954-1289,demarco.info,"{'name': 'Keebler LLC', 'catchPhrase': 'User-c..."
5,6,Mrs. Dennis Schulist,Leopoldo_Corkery,Karley_Dach@jasper.info,"{'street': 'Norberto Crossing', 'suite': 'Apt....",1-477-935-8478 x6430,ola.org,"{'name': 'Considine-Lockman', 'catchPhrase': '..."
6,7,Kurtis Weissnat,Elwyn.Skiles,Telly.Hoeger@billy.biz,"{'street': 'Rex Trail', 'suite': 'Suite 280', ...",210.067.6132,elvis.io,"{'name': 'Johns Group', 'catchPhrase': 'Config..."
7,8,Nicholas Runolfsdottir V,Maxime_Nienow,Sherwood@rosamond.me,"{'street': 'Ellsworth Summit', 'suite': 'Suite...",586.493.6943 x140,jacynthe.com,"{'name': 'Abernathy Group', 'catchPhrase': 'Im..."
8,9,Glenna Reichert,Delphine,Chaim_McDermott@dana.io,"{'street': 'Dayna Park', 'suite': 'Suite 449',...",(775)976-6794 x41206,conrad.com,"{'name': 'Yost and Sons', 'catchPhrase': 'Swit..."
9,10,Clementina DuBuque,Moriah.Stanton,Rey.Padberg@karina.biz,"{'street': 'Kattie Turnpike', 'suite': 'Suite ...",024-648-3804,ambrose.net,"{'name': 'Hoeger LLC', 'catchPhrase': 'Central..."

In [25]:
api_key = "c6d622616af71712b32b3d31695efb70"  # Default API key
city = "London"  # Replace with your desired city
api_url = f"http://api.openweathermap.org/data/2.5/weather?q={city}&appid={api_key}"
try:
    response = requests.get(api_url)
    response.raise_for_status()  # Raise an exception for HTTP errors
    api_data = response.json()
    df_api = pd.json_normalize(api_data)
    print("API Data:")
    print(df_api.head())
except requests.exceptions.HTTPError as http_err:
    print(f"HTTP error occurred: {http_err}")
except Exception as err:
    print(f"An error occurred: {err}")
api_url

API Data:
                                             weather      base  visibility  \
0  [{'id': 801, 'main': 'Clouds', 'description': ...  stations       10000

           dt  timezone       id    name  cod  coord.lon  coord.lat  ...  \
0  1741761540         0  2643743  London  200    -0.1257    51.5085  ...

   main.sea_level  main.grnd_level  wind.speed  wind.deg  clouds.all  \
0            1004             1000        3.09       290          18

   sys.type   sys.id  sys.country  sys.sunrise  sys.sunset
0         2  2091269           GB   1741760480  1741802358

[1 rows x 26 columns]

'http://api.openweathermap.org/data/2.5/weather?q=London&appid=c6d622616af71712b32b3d31695efb70'

In [26]:
df_csv_cleaned = df_csv[['PassengerId', 'Name', 'Sex', 'Age', 'Fare']].dropna()

In [27]:
df_json_cleaned = df_json[['id', 'name', 'email']].rename(columns={'name': 'employee_name'})

In [28]:
df_csv_cleaned['id'] = df_csv_cleaned['PassengerId'] % 10  # Mock 'id' for merging
df_transformed = pd.merge(df_csv_cleaned, df_json_cleaned, on='id', how='inner')

In [51]:
df_api_cleaned = df_api[['weather', 'main.temp', 'main.humidity']].rename(columns={'main.temp': 'temperature', 'main.humidity': 'humidity'})

In [53]:
df_api_cleaned['id'] = df_csv_cleaned['PassengerId'] % 10  # Mock 'id' for merging

In [55]:
df_csv_cleaned['id'] = df_csv_cleaned['PassengerId'] % 10  # Mock 'id' for merging
df_merged = pd.merge(df_csv_cleaned, df_json_cleaned, on='id', how='inner')
df_final = pd.merge(df_merged, df_api_cleaned, on='id', how='inner')

In [58]:
conn = sqlite3.connect('btech.db')

In [60]:
df_transformed.to_sql('transformed_data', conn, if_exists='replace', index=False)

642

In [62]:
df_transformed.to_sql('api_url', conn, if_exists='replace', index=False)

642

In [76]:
df_final.to_sql('df_final',conn, if_exists='replace', index=False)

ProgrammingError: Error binding parameter 9: type 'list' is not supported

In [78]:
print(pd.read_sql('SELECT * FROM df_final LIMIT 10', conn))

Empty DataFrame
Columns: [PassengerId, Name, Sex, Age, Fare, id, employee_name, email, weather, temperature, humidity]
Index: []

In [64]:
print(pd.read_sql('SELECT * FROM transformed_data LIMIT 10', conn))

   PassengerId                                               Name     Sex  \
0            1                            Braund, Mr. Owen Harris    male
1            2  Cumings, Mrs. John Bradley (Florence Briggs Th...  female
2            3                             Heikkinen, Miss. Laina  female
3            4       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female
4            5                           Allen, Mr. William Henry    male
5            7                            McCarthy, Mr. Timothy J    male
6            8                     Palsson, Master. Gosta Leonard    male
7            9  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female
8           11                    Sandstrom, Miss. Marguerite Rut  female
9           12                           Bonnell, Miss. Elizabeth  female

    Age     Fare  id             employee_name                      email
0  22.0   7.2500   1             Leanne Graham          Sincere@april.biz
1  38.0  71.2833   2              Ervin Howell          Shanna@melissa.tv
2  26.0   7.9250   3          Clementine Bauch         Nathan@yesenia.net
3  35.0  53.1000   4          Patricia Lebsack  Julianne.OConner@kory.org
4  35.0   8.0500   5          Chelsey Dietrich   Lucio_Hettinger@annie.ca
5  54.0  51.8625   7           Kurtis Weissnat     Telly.Hoeger@billy.biz
6   2.0  21.0750   8  Nicholas Runolfsdottir V       Sherwood@rosamond.me
7  27.0  11.1333   9           Glenna Reichert    Chaim_McDermott@dana.io
8   4.0  16.7000   1             Leanne Graham          Sincere@april.biz
9  58.0  26.5500   2              Ervin Howell          Shanna@melissa.tv

In [66]:
df_api_cleaned = df_api[['weather', 'main.temp', 'main.humidity']].rename(columns={'main.temp': 'temperature', 'main.humidity': 'humidity'})

In [68]:
df_api_cleaned['id'] = df_csv_cleaned['PassengerId'] % 10  # Mock 'id' for merging

In [70]:
df_csv_cleaned['id'] = df_csv_cleaned['PassengerId'] % 10  # Mock 'id' for merging
df_merged = pd.merge(df_csv_cleaned, df_json_cleaned, on='id', how='inner')
df_final = pd.merge(df_merged, df_api_cleaned, on='id', how='inner')

In [72]:
print(pd.read_sql('SELECT * FROM df_final LIMIT 10', conn))

DatabaseError: Execution failed on sql 'SELECT * FROM df_final LIMIT 10': no such table: df_final